Revit 2027 API
BuiltInFailures.EditingFailures.NoRotateMirrorZ Property
 Element cannot be mirrored or rotated in a manner that changes its angle relative to the ground.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NoRotateMirrorZ { get; }
Public Shared ReadOnly Property NoRotateMirrorZ As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NoRotateMirrorZ {
	FailureDefinitionId^ get ();
}
static member NoRotateMirrorZ : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.EditingFailures Class
Autodesk.Revit.DB Namespace